![IES21](img/logo-ies.png)

## Tratamiento de variables


Practica de Tratamiento de Vatiables con Set de Datos del Titanic

![VARIABLES](img/variables.png)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("data/Titanic-Dataset.csv", sep=",")
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Columna Sex

Se cambian las etiquetas de la columna "Sex" por los valores numéricos **0** y **1**

In [4]:
data['Sex'] = np.where(data['Sex'] == 'male',0,1)

# Columna Embarked

Completamos las dos filas con datos nulos en "Embarket" por la S que es el puerto deonde subieron mayor cantidad de personas

In [5]:
data.loc[data["Embarked"].isnull(),"Embarked"] = "S"

Se establece cada etiqueta de *Embatked* como **1**, **2** y **3** en funcion a la cantidad de pasajeros que abordo el barco en cada Puerto. Mayor cantidad de pasajeros como **3** y menor cantidad como **1**

In [6]:
data['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [7]:
data['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
data['Embarked'] = data["Embarked"].replace({ "S": 3, "C":2, "Q":1})

# Columnas SibSp y Parch

Como ambas columnas indican el tipo de vinculos entre pasajeros, se suman para generar una columna nueva que almacene la misma información

In [9]:
data['Flia'] = data['SibSp'] + data['Parch']

In [10]:
np.unique(data['Flia'])

array([ 0,  1,  2,  3,  4,  5,  6,  7, 10], dtype=int64)

# Columna Age

Como la columna se presenta como útil, se busca la mejor manera de completar los datos faltantes. En unpaso posterior podríamos establecer rango de edades para buscar similitudes entre menos cantidad de datos

A los NaN de la variable "Edad" los reemplazamos por la media de edad en funcion a las variables clase y sexo

In [11]:
for s in range(0, 2):
    for c in range(1, 4):
        media = (data.Age[(data.Survived == s) & (data.Pclass == c) & (data.Sex == s)].mean())
        data.loc[(data.Age.isnull()) & (data.Pclass == c) & (data.Sex == s), "Age"] = media

In [12]:
#bins = [0, 18, 24, 30, 36, 48, 100]
#names = [1, 2, 3, 4, 5, 6]
#data['Rango_Edad'] = pd.cut(data['Age'], bins, labels = names)

In [13]:
#data["Rango_Edad"] = pd.to_numeric(data["Rango_Edad"])

# Columna Cabin

In [14]:
data.Cabin.fillna("Null", inplace = True)
data['Camarote'] = data.Cabin.str.slice(0, 1)

In [15]:
data['Camarote'].unique()

array(['N', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [16]:
bins = ['N', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T']
data['Camarote'].replace(bins,[0,1,2,3,4,5,6,7,8],inplace=True)

# Columna Fare

Cambio los valores nulos de la columna Fare con la media de dicho campo agrupandolos por su Pclass y Fare

In [17]:
data["Fare"].fillna(data.groupby("Pclass")["Fare"].transform("median"), inplace=True)

Se establecen rangos de valores de los Tickets segun 10 percentiles:

In [18]:
#bins = [-1, 8, 13, 24, 38, 7225]
#names = [1, 2, 3, 4, 5]
#data['Rango_Precio'] = pd.cut(data['Fare'], bins, labels = names)

In [19]:
#data["Rango_Precio"] = pd.to_numeric(data["Rango_Precio"])

In [20]:
#data["Rango_Precio"].unique()

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int32
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    int64
 12  Flia         891 non-null    int64
 13  Camarote     891 non-null    int64
dtypes: float64(2), int32(1), int64(8), object(3)
memory usage: 94.1+ KB

# Columna Ticket

In [22]:
data['Ticket'] = list(map(str, data['Ticket'])) #Convierte la lista con elementos enteros en elementos string
data['Ticket'] = [i[-4:] for i in data['Ticket']] #Recorre los elementos de la lista, y les quita los ultimos 4 digitos

In [23]:
data['Ticket'] = data['Ticket'].replace({ "LINE": 1010, "P. 3":2112})

In [24]:
data['Ticket'].unique()

array(['1171', '7599', '1282', '3803', '3450', '0877', '7463', '9909',
       '7742', '7736', '9549', '3783', '2151', '7082', '0406', '8706',
       '2652', '4373', '5763', '2649', '9865', '8698', '0923', '3788',
       '7077', '2631', '9950', '0959', '9216', '7601', '7569', '5677',
       '4579', '7604', '3789', '2677', '2152', '5764', '2651', '7546',
       '1668', '9253', '2123', '0958', '3567', '0371', '4311', '2662',
       '9237', '1295', '9886', '7572', '2926', '3509', '9947', '1026',
       '2697', '4651', '2144', '2669', '3572', '6973', '7088', '7605',
       '2661', '9395', '3464', '1281', '5151', '3111', '4879', '2680',
       '1601', '8123', '9208', '4746', '8738', '4516', '5767', '5779',
       '0932', '3059', '4885', '1278', '6608', '2086', '3275', '3276',
       '7466', '5734', '2315', '4500', '4910', '7754', '7759', '1919',
       '4367', '9245', '9215', '5281', '7540', '1276', '9207', '3120',
       '2991', '9249', '1110', '0465', '2665', '4669', '4136', '2627',
       '1294', '0369', '7558', '4510', '7267', '0372', '7369', '2668',
       '7061', '9241', '1307', '3337', '8414', '9178', '2133', '1752',
       '7534', '7593', '2678', '7081', '1279', '5222', '1945', '3112',
       '0043', '0080', '4310', '1166', '3776', '1206', ' 851', '5302',
       '7597', '5851', '2090', '5037', '2343', '1362', '3595', '7068',
       '5093', '3291', '3505', '7318', '1240', '1280', '7764', '0404',
       '4133', '7595', '0653', 1010, '2131', '0136', '5153', '3767',
       '0365', '1428', '4849', '9247', '4604', '8424', '0046', '7610',
       '8703', '0370', '8747', '5770', '1264', '2628', '3540', '7054',
       '2699', '7231', '2277', '1311', '3528', '1174', '0646', '7229',
       '5273', '1283', '3847', '1813', '4208', '2089', '0367', '1440',
       '9234', '9943', '4348', ' 751', '1173', '6171', '7067', '7442',
       '9566', '6609', '6707', '1921', '8665', '1585', '7230', '4263',
       '1275', '2694', '9928', '7071', '0649', '1751', '4252', '2316',
       '3514', '3336', '0129', '2650', '7585', '0152', '7755', '0433',
       '4461', '0413', '2059', '7248', '7083', '7582', '7760', '3798',
       '0644', '7596', '0375', '3502', '7073', '9853', '2673', '6439',
       '7464', '5778', '0482', '3056', '9239', '5774', '9206', '7798',
       '0373', '9877', '1967', '2163', '9236', '9233', '7612', '2693',
       '3781', '9988', '7226', '6593', '2466', '7421', '7758', '3381',
       '7485', '1767', '7608', '0651', '9243', '3529', '7470', '9011',
       '6928', '6966', '1172', '9219', '4818', '5364', '8551', '1361',
       '3043', '7611', '9225', '7598', '3784', '8740', '4361', '8733',
       '1418', '6525', '7671', '5088', '3510', '2695', '2647', '5783',
       '0931', '0980', '2167', '2691', '1310', '7076', '0813', '2626',
       '4313', '7477', '1765', '1267', '3951', '3503', '2648', '7069',
       '7757', '2653', '1293', '9227', '7849', '7655', '1748', '3760',
       '0034', '1277', '0052', '0407', '8403', '4278', '0929', '1289',
       '1826', '4137', '5096', '8664', '7064', '9106', '2992', '9222',
       '4140', '1269', '3095', '8220', '0652', '8228', '5773', '9254',
       '3032', '5082', '7080', '4244', '2003', '0655', '4851', '2078',
       '0564', '6564', '3085', '1274', '3507', '8723', '5769', '0434',
       '5306', '3638', '3794', '2666', '3786', '5303', '3051', '7453',
       '2817', '9240', '3531', '1060', '9952', '4506', '1320', '4360',
       '2816', '1306', '3792', '6209', '3592', '5089', ' 541', '7553',
       '1027', '3460', '0060', '1298', '9854', '3594', '4134', '1771',
       '8509', '5304', '1317', '3787', '7609', '5380', '6947', '6212',
       '0035', '5086', '4846', '0909', '4135', '6360', '1427', '4001',
       '1316', '7473', '7603', '9209', '6967', '4260', '6875', '9242',
       '2749', '9252', '2624', '2700', '7232', '4258', '7483', '1296',
       '9104', '2641', '2690', '5084', '3050', '7761', '4498', '3568',
       '5735', '2908', '693', '2146', '4358', '0979', '2620', '7085',
       '3807', '1755', '5572', '2622', '9251', '8629', '2082', '2087',
       '8871', '9205', '2686', '0417', ' 752', '1769', '7474', '4312',
       '0589', '8585', '3880', '2689', '1286', '7789', '3049', '3411',
       '7565', '4973', '3235', '1273', '3902', '4848', '9037', '8727',
       '2664', '9214', '3796', '4511', '1426', '9910', '9246', '3804',
       '1305', '0377', '4512', '0845', '1028', '2659', '1753', '0029',
       '4636', '6963', '9533', '9224', '4912', '7042', '7743', '3214',
       '2052', '7668', '1292', '0050', '9231', '3213', '2314', '9221',
       '8475', '0919', '5226', '9223', '9751', '2623', '5727', '9210',
       '1285', '4686', '2993', '3536', '9996', '9750', '2750', '4580',
       '4270', '9856', '9912', '2826', '4138', '0935', '6563', '9228',
       '0036', '4160', '9256', '2672', '3800', '8731', '5852', '8121',
       '7475', '6864', '0025', '3596', '7476', '7482', '3028', '7545',
       '0647', '8124', '4218', '6568', '7062', '0048', '2233', '0643',
       '3806', '5094', '6866', '6853', '1271', '9855', '8425', '3639',
       '9201', '9218', '6988', '6566', '1288', '0648', '3773', '5097',
       '9103', '2096', '5780', '9204', '0042', '9108', '3294', '1272',
       '2663', '7074', '2379', '4850', '8471', '5781', '0047', 2112,
       '2674', '9105', '7078', '3121', '6865', '2687', '3501', '6607',
       '1312', '4887', '1265', '2460', '7600', '9203', '8213', '7465',
       '9244', '2685', '2625', '7089', '7063', '2050', '7087', '3474',
       '8206', '4499', '2058', '1290', '2079', '7075', '5098', '9972',
       '8323', '7228', '2671', '7468', '2223', '7756', '2092', '1774',
       '1287', '2683', '5090', '5547', '9213', '7060', '7592', '2091',
       '3055', '2629', '0026', '8134', '3866', '6852', '2149', '7590',
       '5777', '9248', '695', '5765', '2667', '9212', '9217', '9257',
       '7552', '4068', '2076', '1536', '2053', '1369', '0376'],
      dtype=object)

In [25]:
data['Ticket'] = list(map(int, data['Ticket'])) #Devuelve los elementos de la lista a su estado de entero

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int32
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    int64
 12  Flia         891 non-null    int64
 13  Camarote     891 non-null    int64
dtypes: float64(2), int32(1), int64(9), object(2)
memory usage: 94.1+ KB

# Columnas Name, Cabin, Age, Parch, Fare

Se eliminan las columnas *Name* por tener valores unicos y *Cabin* por tener demasiados datos faltantes

In [27]:
data = data.drop(['Name','SibSp','Parch','Cabin','PassengerId'], axis = 1)

In [28]:
data

,Survived,Pclass,Sex,Age,Ticket,Fare,Embarked,Flia,Camarote
0,0,3,0,22.000000,1171,7.2500,3,1,0
1,1,1,1,38.000000,7599,71.2833,2,1,1
2,1,3,1,26.000000,1282,7.9250,3,0,0
3,1,1,1,35.000000,3803,53.1000,3,1,1
4,0,3,0,35.000000,3450,8.0500,3,0,0
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27.000000,1536,13.0000,3,0,0
887,1,1,1,19.000000,2053,30.0000,3,0,6
888,0,3,1,19.329787,6607,23.4500,3,3,0
889,1,1,0,26.000000,1369,30.0000,2,0,1
890,0,3,0,32.000000,376,7.7500,1,0,0

Se normaliza la columna Fare para evitar desvalance en el peso de los valores de las columnas

In [29]:
data['Ticket'] = data['Ticket'] /data['Ticket'].abs().max()

In [30]:
data['Ticket'].min()

0.002501000400160064

In [31]:
data['Ticket'].max()

1.0

In [32]:
data

,Survived,Pclass,Sex,Age,Ticket,Fare,Embarked,Flia,Camarote
0,0,3,0,22.000000,0.117147,7.2500,3,1,0
1,1,1,1,38.000000,0.760204,71.2833,2,1,1
2,1,3,1,26.000000,0.128251,7.9250,3,0,0
3,1,1,1,35.000000,0.380452,53.1000,3,1,1
4,0,3,0,35.000000,0.345138,8.0500,3,0,0
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27.000000,0.153661,13.0000,3,0,0
887,1,1,1,19.000000,0.205382,30.0000,3,0,6
888,0,3,1,19.329787,0.660964,23.4500,3,3,0
889,1,1,0,26.000000,0.136955,30.0000,2,0,1
890,0,3,0,32.000000,0.037615,7.7500,1,0,0

In [33]:
data.describe()

,Survived,Pclass,Sex,Age,Ticket,Fare,Embarked,Flia,Camarote
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.352413,29.389701,0.471071,32.204208,2.638608,0.904602,0.811448
std,0.486592,0.836071,0.477990,13.427855,0.294340,49.693429,0.635673,1.613459,1.815143
min,0.000000,1.000000,0.000000,0.420000,0.002501,0.000000,1.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,21.000000,0.214486,7.910400,2.000000,0.000000,0.000000
50%,0.000000,3.000000,0.000000,27.255814,0.416166,14.454200,3.000000,0.000000,0.000000
75%,1.000000,3.000000,1.000000,36.000000,0.747199,31.000000,3.000000,1.000000,0.000000
max,1.000000,3.000000,1.000000,80.000000,1.000000,512.329200,3.000000,10.000000,8.000000

# Preparacion de datos para incluirlos en los modelos

In [34]:
X = data.drop('Survived', axis = 1)
y = data['Survived']

In [35]:
from sklearn.model_selection import train_test_split

In [36]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=123)
X_val_train, X_val_test, y_val_train, y_val_test = train_test_split(X_train, y_train, test_size=0.2, random_state=123)

In [37]:
X_train.shape, y_train.shape, X_val_train.shape, X_val_test.shape, y_val_train.shape, y_val_test.shape

((712, 8), (712,), (569, 8), (143, 8), (569,), (143,))

In [38]:
from sklearn import linear_model
from sklearn.metrics import confusion_matrix, accuracy_score, f1_score

In [39]:
rLog = linear_model.LogisticRegression(fit_intercept = True, class_weight='balanced', n_jobs = -1, random_state = 123)
rLog.fit(X_val_train, y_val_train)
y_pred = rLog.predict(X_val_test)
acc_rLog = accuracy_score(y_val_test, y_pred)
acc_rLog

0.7832167832167832

In [40]:
from sklearn.neighbors import KNeighborsClassifier

In [41]:
knn = KNeighborsClassifier()
knn.fit(X_val_train, y_val_train)
y_pred_knn = knn.predict(X_val_test)
acc_knn = accuracy_score(y_val_test, y_pred_knn)
acc_knn

0.6993006993006993

In [42]:
from sklearn.tree import DecisionTreeClassifier

In [43]:
tree = DecisionTreeClassifier(random_state = 123)
tree.fit(X_val_train, y_val_train)
y_pred_tree = tree.predict(X_val_test)
acc_tree = accuracy_score(y_val_test, y_pred_tree)
acc_tree

0.7692307692307693

In [44]:
print('Reg Log:', acc_rLog, "Knn:", acc_knn, "Arbol:", acc_tree)

Reg Log: 0.7832167832167832 Knn: 0.6993006993006993 Arbol: 0.7692307692307693